README.org
#+title: Generic Netlink Asymetric Communication


* Description
Generic Netlink Asymetric Communication kernel module allows for different
processes to communicate through the netlink protocol.

* Instructions

** Automatic setup
A command line utility is provided in order to interact with the
kernel module.

Compile the module with specific netlink family name:
#+begin_src bash

#+end_src

To load the last compiled module:
#+begin_src bash

#+end_src

To unload the module with specific netlink family name:
#+begin_src bash

#+end_src

** Manual Setup

To compile the module:
#+begin_src bash
make
#+end_src

To load the module into the kernel:
#+begin_src bash
sudo insmod driver.ko
#+end_src
